use spares

/*завдання 2: Внести дані в БД (Insert).*/

insert into Manufacturer([Name], Adress, Phone)
values('BestFind', 'Mashynobudivna St, 50', '+380632338185'),
('72.ua', 'Korabelna St, 8', '+380664327272'), 
('FD crankshaft', 'Elektrotekhnichna St, 47b', '+380685255775'), 
('Tov Omeha', 'Valentyny Chaiky St, 4', '+380577136900'), 
('AMS', 'Bohatyrska St, 12', '+380976024245'), 
('VAG UA', 'Vulytsya Pivnichno-Syrets`ka, 49В', '+380689668082'), 
('Kiev Autopromzapchst', 'Yuriya Shums`koho St, 5', '-'), 
('Avtomahazyn Ooo Avtokompanyya Khors', 'Shakhtarska St, 8', '+380444514199'), 
('Sto Avtolot', 'Saperno-Slobidska St, 25', '+380971709016'), 
('Avtonova-D', 'Baltiis`kyi Ln, 20', '+380444909190')

insert into Delivery(DateDel, IdMan)
values('2021-12-20', 3), 
('2021-12-21', 2), 
('2021-12-22', 1),
('2021-12-23', 4)

insert into Price(Val)
values(1000), 
(2000), 
(900), 
(2), 
(60000)

insert into Detail([Name], Article, Note)
values('Brake pads', 'a', 'Гальмова колодка — частина гальмівної системи і її основний робочий компонент.'), 
('Disks', 'b', 'Частина колеса, обідок.'),
('Clutch', 'c', 'Зчеплення (муфта зчеплення) — механізм, що з*єднує двигун із трансмісією та дає змогу тимчасово роз*єднувати їх під час перемикання передач, гальмування і зупинки'), 
('Battery', 'd', 'Акумулятор (енергії) (лат. — збирач) — пристрій, в якому нагромаджується (акумулюється) енергія.'), 
('Headlights', 'e', 'Фара (від грецького «Фарос») — джерело спрямованого світла, встановлений на транспортному засобі, призначений для освітлення навколишньої місцевості, дороги.'), 
('Radiator', 'f', 'Радіатор (новолат. radiātor — «випромінювач») — пристрій для розсіювання тепла у повітрі (випромінюванням та конвекцією), повітряний теплообмінник.'), 
('Carburetor', 'h', 'Карбюра́тор (від фр. carburateur, утвореного від carbure — «карбід») — пристрій, що використовується для отримання суміші повітря з паливом для двигуна внутрішнього згоряння.'), 
('Engine', 'j', 'Двигу́н, руші́й, мото́р (або силова установка) — енергосилова машина, що перетворює який-небудь вид енергії на механічну роботу.'), 
('Belt drive', 'k', '-'), 
('Gearbox', 'l', 'Механічна коробка передач (МКП) — механізм, призначений для східчастої зміни передавального відношення, в якому вибір передачі здійснюється оператором (водієм) вручну.'), 
('Axle,', 'm', 'Міст — конструктивний елемент автомобіля, що з*єднує між собою колеса однієї осі.'), 
('Cardan drive', 'n', 'Карданна передача (універсальний шарнір, шарнір Гука, універсальна муфта, механізм Кардана) — просторовий шарнірний механізм, що складається з центральної хрестовини і двох посаджених на кінці валів-вилок, що шарнірно сполучені з кінцями хрестовини.'), 
('Wheel drive', 'o', '-'), 
('Suspension', 'p', 'Підвіска автомобіля, або система підресорювання — сукупність деталей, вузлів і механізмів, які грають роль сполучної ланки між кузовом автомобіля і дорогою'), 
('Body', 'q', 'Ко́рпус (від лат. corpus — «тіло») — основна частина машини, механізму. Корпус легкового автомобіля — кузов на шасі, корпус вантажівки — шасі з кабіною.'), 
('Steering', 'g', 'Система кермування, кермове керування, рульове керування, кермове управління — сукупність елементів для спрямування руху транспортного засобу в бажаному напрямку за допомогою кермового колеса (кермування).'), 
('Brake system', 'r', 'Гальмівна́ систе́ма автомобі́ля (альтернативна форма: гальмова́ систе́ма автомобі́ля) — сукупність пристроїв, призначених для здійснення гальмування АТЗ, — поступового сповільнення чи зупинки транспортного засобу, обмеження його швидкості на спусках або для забезпечення його нерухомого стану під час стоянки.'), 
('Ignition system', 's', 'Система запалювання — це одна з головних систем в автомобілі, яка призначена для запалення робочої суміші в циліндрах двигунів внутрішнього згоряння.'), 
('Supply system', 't', '-'), 
('Starting system', 'u', '-'), 
('Cooling and heating system', 'v', '-'), 
('Air conditioner', 'w', 'Автомобільний кондиціонер - це система, яка дає можливість охолодити повітря, що потрапляє в салон машини з вулиці. '), 
('Glass cleaning system', 'i', 'Склоочи́сник (також «двірни́к») — це пристрій, що використовується для видалення крапель дощу (вологи) і бруду з вітрового скла автомобіля.'), 
('Filters', 'x', 'Фільтри захищають від забруднень вузли і системи в машині'),
('Tires', 'y', 'Автошина (побутові та жаргонні назви: скат, покришка або опона) — шина, яка встановлюється на ободі колеса автомобілю і заповнюється повітрям або іншим газом під тиском.')

insert into PriceChange(PriceId, DateChange, ManId, IdDet)
values(1, '2021-12-17', 3, 1), 
(1, '2021-12-16', 3, 1), 
(1, '2021-12-20', 3, 1),
/*друга делівері*/
(2, '2021-12-16', 2, 2), 
(3, '2021-12-20', 2, 3), 
(4, '2021-12-16', 2, 2), 
(5, '2021-12-20', 2, 3),
(1, '2021-12-21', 2, 3)




/*виконання процедури*/
exec InsertDetailInDelivery 1, 1, 5
exec InsertDetailInDelivery 2, 2, 7
exec InsertDetailInDelivery 2, 3, 10

select *
from DetailInDelivery

/*виконання функції*/
select * 
from Define_Delivery('2021-12-20')